Repository: tovDmitrij/KeyLab
Catalog: api/helper.v1.localization/Localizations/Localization.*.resx
Languages: ru_ru

# BoxDescription_IsNotValid
source: Keyboard box description is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Описание бокса клавиатуры не валидное. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# BoxTitle_IsBusy
source: A keyboard box with the given name already exists on the current account
ru_ru: Бокс клавиатуры с заданным именем уже существует на текущем аккаунте

# BoxTitle_IsNotValid
source: Keyboard box name is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Наименование бокса клавиатуры не валидное. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# BoxType_IsNotExist
source: The type of keyboard box with the given parameters does not exist
ru_ru: Типа бокса клавиатуры с заданными параметрами не существует

# EmailCode_IsNotExist
source: The registration confirmation code with the specified parameters does not exist
ru_ru: Кода подтверждения регистрации с заданными параметрами не существует

# EmailCode_IsSuccessfullSend
source: The registration confirmation code was successfully sent to the specified e-mail address
ru_ru: Код подтверждения регистрации был успешно отправлен на указанную почту

# EmailVerification_EmailLabel
source: KeyLab. Mail confirmation code
ru_ru: KeyLab. Код подтверждения почты

# EmailVerification_EmailText
source: <h3>Mail confirmation code to register on the platform</h3><b>{0}</b><p>The code will be active for 5 minutes.</p><p>This email was automatically generated. You do not need to respond to it.</p>
ru_ru: <h3>Код подтверждения почты для регистрации на платформе</h3><b>{0}</b><p>Код будет активен в течение 5 минут.</p><p>Это письмо было создано автоматически. На него отвечать не нужно.</p>

# Email_SendVerificationCode
source: The account confirmation code was successfully sent to the specified email address
ru_ru: Код подтверждения аккаунта был успешно отправлен на указанную почту

# File_IsNotAttached
source: The file is corrupted or was not attached
ru_ru: Файл повреждён или не был прикреплён

# File_IsNotExist
source: The file with the specified parameters does not exist
ru_ru: Файла с заданными параметрами не существует

# File_IsSuccessfullDeleted
source: The file was successfully deleted
ru_ru: Файл был успешно удалён

# File_IsSuccessfullUpdated
source: The file has been successfully updated
ru_ru: Файл был успешно обновлён

# File_IsSuccessfullUploaded
source: The file was successfully saved
ru_ru: Файл был успешно сохранён

# KeyboardDescription_IsNotValid
source: Keyboard description is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Описание клавиатуры не валидное. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# KeyboardTitle_IsBusy
source: A keyboard with the specified name already exists on the current account
ru_ru: Клавиатура с заданным именем уже существует на текущем аккаунте

# KeyboardTitle_IsNotValid
source: Keyboard name is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Наименование клавиатуры не валидное. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# Keycap_IsNotExist
source: The key with the specified parameters does not exist
ru_ru: Клавиша с заданными параметрами не существует

# KitTitle_IsNotValid
source: The name of the keycap set is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Наименование набора кейкапов не валидное. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# Kit_IsNotExist
source: There is no set of keycaps with the given parameters
ru_ru: Набора кейкапов с заданными параметрами не существует

# PaginationPageSize_NotValid
source: Page size is not valid
ru_ru: Размер страницы не валидный

# PaginationPage_NotValid
source: Page number is not valid
ru_ru: Номер страницы не валидный

# Preview_IsNotAttached
source: The file preview is corrupted or was not attached
ru_ru: Превью файла повреждено или не было прикреплено

# SwitchType_IsNotExist
source: The type of switch with specified parameters does not exist
ru_ru: Типа переключателя с заданными параметрами не существует

# UserAccessToken_IsExpired
source: Access token is expired or damaged. Go through the authorization process again
ru_ru: Access токен просрочен или повреждён. Пройдите заново процесс авторизации

# UserEmail_IsBusy
source: The specified mail is already occupied by another user
ru_ru: Заданная почта уже занята другим пользователем

# UserEmail_IsNotValid
source: The mail is not valid. Example: ivanov@mail.ru
ru_ru: Почта не валидная. Пример: ivanov@mail.ru

# UserNickname_IsNotValid
source: Nickname is not valid. Allowed characters: letters, numbers. Min. length is 3 characters
ru_ru: Никнейм не валидный. Разрешённые символы: буквы, цифры. Мин. длина 3 символа

# UserPasswords_IsNotEqual
source: Passed password values do not match
ru_ru: Переданные значения паролей не совпадают

# UserPassword_IsNotValid
source: Password is not valid. Allowed characters: letters, numbers. Min. length is 8 characters
ru_ru: Пароль не валидный. Разрешённые символы: буквы, цифры. Мин. длина 8 символов

# UserRefreshToken_IsExpired
source: Refresh token is expired or damaged. Go through the authorization process again
ru_ru: Refresh токен просрочен или повреждён. Пройдите заново процесс авторизации

# UserSignIn_EmailLabel
source: The account has been logged in
ru_ru: Был совершён вход в аккаунт

# UserSignIn_EmailText
source: You have logged into your account on the KeyLab platform. If it was not you, change your password
ru_ru: Был совершён вход в аккаунт на платформе KeyLab. Если это были не вы, то смените пароль

# UserSignUp_IsSuccessfull
source: The new account was successfully registered
ru_ru: Новый аккаунт был успешно зарегистрирован

# User_IsNotBoxOwner
source: The current user does not own the box with the specified parameters
ru_ru: Текущему пользователю не принадлежит бокс с указанными параметрами

# User_IsNotExist
source: The user with the specified parameters does not exist
ru_ru: Пользователя с заданными параметрами не существует

# User_IsNotKeyboardOwner
source: The current user does not own a keyboard with the specified parameters
ru_ru: Текущему пользователю не принадлежит клавиатура с указанными параметрами

# User_IsNotKitOwner
source: The current user does not own the set of keycaps with the specified parameters
ru_ru: Текущему пользователю не принадлежит набор кейкапов с указанными параметрами
